app/controllers/admin/customers_controller.rb

	def update
		@customer = Customer.find(params[:id])
		@customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "last_name" = ?, "first_name" = ?, "is_deleted" = ? WHERE "customers"."id" = ?  [["last_name", "あたたた"], ["first_name", "あおおお"], ["is_deleted", 1], ["id", 1]]