app/controllers/admin/genres_controller.rb

	def create
		genre = Genre.new(genres_params)
		genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "ジュース"], ["created_at", "2020-12-13 07:53:42.806109"], ["updated_at", "2020-12-13 07:53:42.806109"]]

	def update
		@genre = Genre.find(params[:id])
		@genre.update(genres_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "コーヒーaa"], ["updated_at", "2020-12-15 12:29:08.806425"], ["id", 2]]