app/controllers/admin/items_controller.rb

	def new
		@item = Item.new
		@genres = Genre.all
---
SELECT "genres".* FROM "genres"

	def create
		item = Item.new(item_params)
		item.save
---
INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "is_active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@item = Item.find(params[:id])
		@genres = Genre.all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"

	def update
		@item = Item.find(params[:id])
		@item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "ae8b7520e7ec4f33f98db224cf35d3b17d9355572a8964e867009fbd129b"], ["updated_at", "2020-12-13 09:19:43.206506"], ["id", 1]]