app/controllers/public/cart_items_controller.rb

  	def create
    	@cart_item = CartItem.new(cart_item_params)
    	@cart_item.customer_id = current_customer.id
    	@cart_item.save
---
INSERT INTO "cart_items" ("amount", "item_id", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["amount", 2], ["item_id", 1], ["customer_id", 2], ["created_at", "2021-01-11 09:37:16.329276"], ["updated_at", "2021-01-11 09:37:16.329276"]]

  	def destroy
  		@cart_item = CartItem.find(params[:id])
    	@cart_item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 2]]