app/controllers/public/homes_controller.rb

SELECT "genres".* FROM "genres"
SELECT "items".* FROM "items" ORDER BY "items"."created_at" DESC
---
	def top
		@genres = Genre.all
		@items = Item.all.order(created_at: :desc)