app/controllers/public/items_controller.rb

	def index
		@genres = Genre.all

		if params[:genre].blank?
			@genre_name = '商品'
		else
			@genre_name = Genre.find(params[:genre]).name
		end

		if params[:genre].blank?
			@items = Item.all
		else
			@items = Item.where(genre_id: params[:genre])
		end

		if params[:genre].blank?
			@items_count = Item.count
		else
			@items_count = @items.count
---
SELECT "genres".* FROM "genres"
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "items".* FROM "items"
SELECT "items".* FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 1]]
SELECT COUNT(*) FROM "items"
SELECT COUNT(*) FROM "items" WHERE "items"."genre_id" = ?  [["genre_id", 3]]

	def show
		@genres = Genre.all
		@item = Item.find(params[:id])
---
SELECT "genres".* FROM "genres"
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]