app/controllers/addresses_controller.rb

	def index
		@address = Address.new
		@addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

	def create
		@address = Address.new(address_params)
		@address.save
---
INSERT INTO "addresses" ("name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "1111"], ["postal_code", "1111"], ["address", "1111"], ["created_at", "2020-12-15 06:20:01.169084"], ["updated_at", "2020-12-15 06:20:01.169084"]]

	def update
		@address = Address.find(params[:id])
		@address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "postal_code" = ?, "address" = ?, "name" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postal_code", "1111ddd"], ["address", "1111ddd"], ["name", "1111aaaaddd"], ["updated_at", "2020-12-15 06:37:02.490794"], ["id", 1]]

	def destroy
		address = Address.find(params[:id])
    	address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 2]]