app/controllers/items_controller.rb

	def index
		@genres = Genre.all
		@items = Item.all
---
SELECT "genres".* FROM "genres"
SELECT "items".* FROM "items"